C02M/provisioning.org
#+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [letterpaper, 10pt]
#+LATEX_HEADER: \usepackage[paperwidth=8.5in, paperheight=11in, hmargin=0.5in, vmargin=0.5in]{geometry}
#+LATEX_HEADER_EXTRA:

* Reminders

- The means justify the ends
  - Makes entirety of the effort achievable, sensible, and valuable
- Be ready for surprises
  - You will learn new things every run
  - You will be surprised by things every run
  - You have to decide if it is an opportunity to better things or
    it is something to get upset about
    - Only you may decide
- Each top level section might be completed in entirety
  - Take brakes between them
  - Take over-night breaks
  - The whole thing takes a while
- Right-click to paste text into the terminal
  - If you Pretzel-v it, it doesn’t work right
- Make scripts executable and run them
  - =sh= doesn’t do what you want and you always forget that
- If one of your purchased apps doesn’t show up in AppStore then just buy it again
  - The store will detect that you already own it and ask you to install it
  - Growl always has this problem
  - Used to reboot to fix it, but unreliable
- This whole thing only makes sense when you read each line
  - Partially because you forget after not doing it for a while
  - The order is critical
  - A lot of the steps are automated and only make sense after you understand
    the entire script
  - There are still a lot of manual steps though
  - For example automate app installs and manually configure them, *before* moving
    on to the next section
  - Everything must be completed before moving on to the next thing
- Disk image verification
  - Recipes exist to disable it
  - I don't use them; I want to know every time that all of my disk images are
    in a known good state
- Try running every program
  - Only way to identify failures
  - Only way to automate the correct way
  - Continue to find new issues and fixes
- Total transparency
  - I've run this 7 times already
  - Every time I run it I find new bugs and new improvements
  - Provisioning reveals just how much
    - One doesn't know about their OS
    - Things can go really well despite the fact we don't know how to do it
      right
- Automated provisioning is handled by [[https://github.com/grettke/kitchenplan][kitchenplan]]
- Be thoughtful
  - This is not unique to this box, I just always forget
  - For example when I install emacs
    - I didn't think about using the main GNU release versus railwaycat's
      - That was dumb because I didn't think about the implications
    - First time, I installed all additioonal libraries
      - That was dumb because you should only install what you specifically need
    - Brew
      - It is very easy to use Brew
      - It will install a lot of stuff to make you happy
      - If you don't pay attention to what it does to make you happy then it
        will eventually make you unhappy
- Only run this setup with a reliable high-speed Internet connection
  - Ran this at off-site, and 40% of the downloads failed
- Once you get comfortable a couple of things happen
  - You try to paralellize stuff to save time and it is a big mistake which
    totally defeats the purpose of taking it slowly and easy because inevitably
    you will make mistakes
  - You forget that the means justify the ends; take it slowly and easy and
    perform the steps in that manner
  - You will form an opinion based upon experience rather than fantasy
    - Everyone is entitled to an opinion
    - Some opinions are more valuabe then others
    - Experience trumps fantasy *every* time
    - Take this dev-ops task as an opportunity to form your own
      person-preference
    - Valuable opinions come about as a result of a lot of good learning

* Prerequisites, Manual

** Scripts

- Log into BitBucket/GitHub using Safari
  - When I develop this system, do so out of GitHub and when I finished I
    publish it via GitHub.
- Download the hardware repo to get a current copy all the artifacts
- Keep the setup guide open both on a smartphone and on the computer to clearly
  track what is happening where
  - Seems like overkill but it is really simpler because it is easy to lose your
    place during reboots when OSX "forgets" the line that you were on
- Previously I copied the contents to a hard drive and this was useless because
  in order to provision a machine you require Internet access so nothing was
  made easier with this step

** Image Disk

- Boot from EF4829
- Dismount C02M
- Erase C02M
  - You have the ability to specify the file system (FS) here
  - For this guide, it is not required, because CCC will restore a disk image
    that has a file system that is Mac OS Extended Journaled (MOSEJ)
  - The default is Mac OS Extended (not journaled)
  - I suspect though that if I don't specify it here, then at some point I will
    either copy or move this passage of text, and since it does not mention the
    desired file system (MOSEJ), that it will result in a documentation bug
  - When you do this, specify the FS and MOSEJ
- Mount 01
- Restore 01 to C02M
- Dismount 01
- Restore rescue partition on C02M
- Boot from C02M
- Dismount EF4829

** Recovery Partition

- Pretzel-r on boot to enter it
- This makes sure that it works

*** Console Password (One Time Only)

- Set the firmware password

** System Preferences

*** Keyboard

- Swapped caps lock and control

*** Displays

- Resolution: Scaled
  - More Space (1920x1200

- Arrangement
  - Mirror screens

** Software Updates

- Installed software updates
  - Previously this was followed by manual reboot and that was needless
- On restart, check updates again by clicking on it to see if there are more and
  if there are then install them
  - There is a slight delay where the screen says that there are no updates
    /before/ it refreshes and tellls you that it is again checking

** Profile

Download the =~/.profile= and evaluate it. This may be a download, or just copy
from the download of the repo. I am working through the best option, as both
have seemed fine.

#+begin_src sh :tangle .profile :comments no
export PS1='\u@\h:\w> '
export HOMEBREW_NO_EMOJI=1
export INFOPATH='/usr/local/share/info:/usr/share/info'
export VAGRANT_DEFAULT_PROVIDER=vmware_fusion
source `brew --repository`/Library/Contributions/brew_bash_completion.sh
export EELIB="/Users/$(whoami)/EELIB"
export JAVA_HOME="/Library/Java/JavaVirtualMachines/jdk1.8.0_40.jdk/Contents/Home"
export MACTEX_BIN="/usr/local/texlive/2014/bin/x86_64-darwin"
export PATH=/usr/local/bin:$JAVA_HOME/bin:$MACTEX_BIN:$PATH
alias r='r --no-save'
alias R='r --no-save'
alias bbc='~/git/github-grettke/stathon/stathon.py ~/git/bitbucket-grettke/ | grep True'
alias gbc='~/git/github-grettke/stathon/stathon.py ~/git/github-grettke/ | grep True'
#+end_src

After setting up the system, just link it here:

#+begin_src sh
cd ~/
rm .profile
ln -s ~/git/bitbucket-grettke/hardware/apple/macbookpro/c02m/.profile .profile
#+end_src

** Install XCode

I want Xcode. I want the CLT. I want the IDE and more. I also want KitchenPlan.
The installation order of these things was not obvious to me. I got it wrong 3
times. Now it works correctly. Install Xcode and then CLT and then everyone
seems to be happy.

Go to the App Store and install it.

You must start Xcode and agree to its licensing. Afterwards, close it.

For reference, see where it lives.

#+begin_src sh
xcode-select --print-path
#+end_src

#+NAME:
#+begin_example
/Applications/Xcode.app/Contents/Developer
#+end_example

Now install the CLT. Choose *Install*.

#+begin_src sh
xcode-select --install
#+end_src

Note here that the Xcode path does not change. I don't understand this. What I
think is happening is that Xcode is installed and that it is providing
everything that is required and CLT piggy-backs on it.

#+begin_src sh
xcode-select --print-path
#+end_src

#+NAME:
#+begin_example
/Applications/Xcode.app/Contents/Developer
#+end_example

** Brew and BrewCask

Brew is [[http://brew.sh][here]].

Run

#+begin_src sh
brew doctor
#+end_src

BrewCask is [[http://caskroom.io][here]].

* Git, Semi-Automated

After setting up this box, check out your stuff later before imaging.

** Manual

Install DiffMerge.

Previously I used Meld. That worked fine. It was in Python. Brew installed it's
own Python. I didn't like that. That is why I switched to DiffMerge. I didn't
want to install Brew Python in addition to OSX Python. Personal preference.

My old setup had a problem. In Git I set up the external.diff to Meld.
external.diff is only for command line tools. Meld is a GUI. That was wrong.
I got a poor-user experience with git and vc-diff and Magit as a result.

This is the first BrewCask install, so it asks you for your password.

#+begin_src sh
brew cask install diffmerge
#+end_src

Later in this setup, once the fonts are installed, set this font to DJSM 14.
That is smaller than the Emacs default on my system. That is OK because I want
to do side-by-side diffs in 50% of the screen. 14 is a fine balance between
readability and fitting in that space.

