C02M/provisioning.org
** Automated
   :PROPERTIES:
   :tangle:  git.sh
   :comments: no
   :END:

Generate the key. There is no passphrase.
#+begin_src sh
mkdir ~/.ssh
cd ~/.ssh
ssh-keygen -N '' -t rsa -C "gcr@wisdomandwonder.com" -f orion_gcr_rsa
#+end_src

Set permissions so that =ssh= will run.

#+begin_src sh
chmod 600 ~/.ssh/orion_gcr_rsa
chmod 600 ~/.ssh/orion_gcr_rsa.pub
ssh-add -K ~/.ssh/orion_gcr_rsa
#+end_src

OSX creates this directory everywhere and it must be ignored.
#+begin_src sh
echo .DS_Store >> ~/.gitignore_global
git config --global core.excludesfile ~/.gitignore_global
#+end_src

Add they key to Bitbucket and Github.
#+begin_src sh
cat ~/.ssh/orion_gcr_rsa.pub | pbcopy
read -p "The new key is in your clipboard. Go and add this key to BitBucket and GitHub. When you are finished, hit [enter] to continue."
#+end_src

Set up ~/.ssh/config.

#+begin_src sh
cat > ~/.ssh/config << EOF
Host github-grettke
     HostName github.com
     User git
     PreferredAuthentications publickey
     IdentityFile ~/.ssh/orion_gcr_rsa.pub
Host bitbucket-grettke
     HostName bitbucket.org
     User git
     PreferredAuthentications publickey
     IdentityFile ~/.ssh/orion_gcr_rsa.pub
EOF
#+end_src

Test each one out.
#+begin_src sh
ssh -T github-grettke
read -p "Did it work? If not, fix it."
#+end_src

Separate them to allow for easier copy-pasting.

#+begin_src sh
ssh -T bitbucket-grettke
read -p "Did it work? If not, fix it."
#+end_src

Set up my preferences.
#+begin_src sh
git config --global user.name "Grant Rettke"
git config --global user.email gcr@wisdomandwonder.com
git config --global core.editor vi
git config --global color.ui true
git config --global core.autocrlf
git config --global alias.st status
git config --global alias.ci commit
git config --global merge.tool diffmerge
git config --global mergetool.diffmerge.cmd "/usr/local/bin/diffmerge --merge --result=\$MERGED \$LOCAL \$BASE \$REMOTE"
git config --global mergetool.keepBackup false
git config --global diff.tool diffmerge
git config --global difftool.diffmerge.cmd "/usr/local/bin/diffmerge \$LOCAL \$REMOTE"
#+end_src

Check out projects to get basic stuff working.
#+begin_src sh
mkdir -p ~/git/bitbucket-grettke
mkdir -p ~/git/github-grettke
mkdir -p ~/git/github-anon
cd ~/git/bitbucket-grettke
git clone bitbucket-grettke:grettke/alec.git
git clone bitbucket-grettke:grettke/list.git
git clone bitbucket-grettke:grettke/hardware.git
git clone bitbucket-grettke:grettke/resume.git
git clone bitbucket-grettke:grettke/rule-engine-notes.git
cd ~/git/github-grettke
git clone github-grettke:grettke/home.git
git clone github-grettke:grettke/kitchenplan.gi
git clone github-grettke:grettke/stathon.git
git clone github-grettke:grettke/osx-provision.git
cd ~/git/github-anon
git clone git@github.com:tomislav/osx-terminal.app-colors-solarized.git
#+end_src

There are a lot of ways to manage libraries for Python. There are also many ways
to manage Python installations. I am not considering any of them here. My
approach is to use the base-box as a base. It needs to do certain things well.
These directions are for my current approach.

Directions for installing Pip live [[https://pip.pypa.io/en/latest/installing.html][here]].

#+begin_src sh
mkdir ~/tmp
cd ~/tmp
curl -O https://bootstrap.pypa.io/get-pip.py
sudo -H python ./get-pip.py
#+end_src

Install GitPython for Stathon.

#+begin_src sh
sudo pip install GitPython==0.3.2.RC1
#+end_src

* OSX GUI Config, Manual

Read the [[https://github.com/kitchenplan/kitchenplan][directions]].

#+begin_src sh
sudo gem install kitchenplan
#+end_src

Start the setup.

#+begin_src sh
kitchenplan setup
#+end_src

When it asks, give my aliased URL so I can work right out of that directory.

#+begin_src sh
github-grettke:grettke/kitchenplan.git
#+end_src

Provision it.

#+begin_src sh
kitchenplan provision
#+end_src

Log in and out again to see changes. Previously I would reboot the machine, but
that seems unnecessary.

The first two times I tested this, the desktop picture was set correctly. The
3rd time it was not. Also 4-6. I'm leaving that alone for now.

KitchenPlan may be run repeatedly. After completing various sections of this
script I re-ran KitchenPlan. It worked correctly.

* Emacs Environment Semi-Automated

This is what it takes to get an Emacs+Org development environment set up.
Nearly everything is included but for LaTeX, which has an enormous download.

The way that I like to go through this is to:
- Perform the steps in the manual section
- Execute =emacs-run.sh= for the automated stuff
- Perform the manual configuration for everything that got installed
  - Directions are in =emacs-read.org=

** System Software

*** Manual

**** Fonts

#+begin_src org :tangle emacs-read.org
Manually install fonts used for Emacs.

Fonts that will be installed:
- DejaVu
- NotoSans
- NotoSansSymbols
- Quivira
- Symbola

They live in the font dir in the ALEC project.

Steps to install them:
- Extract them
- Start Font Book
- Create a new COLLECTION "Emacs"
- Drag the top-level  directory into the collection
  - Font Book will search through it recursively for fonts and add them
- Correct any resolution issues, which happen every time so far
#+end_src

**** Terminal

Select the Solarized dark theme. It is checked out in Github-Anon. Go into
preferences, choose it, and set it as the default.

Set the font to DJSM 17.

**** Growl

Install Growl via AppStore. Run it. Enable it to run on login.

*** Automated

Do the manual configuration of this stuff right away. The system is unusable
without it. For some reason I find it easy to forget that.

**** XQuartz

Why is this here? It used to be for Meld. Meld went away. It definitely /feels/
right to be here. It is nice to have a X-Server. Stuff like the =dot= tool
use X. I am staying true-enough here.

This install asks for a password. I am done researching what asks for a password
and what does not. Perfect world I would do that and break out the steps into
things that ask for a password and things that to do not. In that perfect world,
time does not exist. To do this in a world with time will take a lot of it.

Asking for passwords appears to be an application-specific event and not based
on order of Brew and BrewCask installs. Even if there is more to it, I am not
researching it more now.

#+begin_src sh :tangle emacs-run.sh :comments no
brew cask install xquartz
#+end_src

**** Karabiner

#+begin_src sh :tangle emacs-run.sh :comments no
brew cask install karabiner
#+end_src

#+begin_src org :tangle emacs-read.org
Run it. Approve it. Configure it with the following. Look for the
heading with the name below following "Modify".

,#+begin_src sh
Modify "Change Return Key".
Check:
"Return to Control_L
(+ When you type Return only, send Return)"
,#+end_src
#+end_src

**** Spectacle

#+begin_src sh :tangle emacs-run.sh :comments no
brew cask install spectacle
#+end_src

#+begin_src org :tangle emacs-read.org
Run it. Approve it. Set it to run at login.
#+end_src

**** Bartender

#+begin_src sh :tangle emacs-run.sh :comments no
brew cask install bartender
#+end_src

#+begin_src org :tangle emacs-read.org
- GENERAL
  - Launch Bartender at login: yes.
  - At bartender launch: show bartender bar: NO.
  - Bartender bar: autohides, YES.
- Menu bar icon highlight
  - Show when bartender bar is open: YES.
  - Bartender menu baricon:
- ADVANCED
  - Bartender menu bar icon: visible YES.
  - Clicking on bartender will: open bartender bar.
  - For everything moved into the gutter
  - I made it display in the main for 5m.

- Ordered them (reorder by holding Pretzel and dragging them) (do this after installing everything)
  - little snitch
    - Can't move this one at all anyway
  - Date/Time
  - Volume
  - Keychain Access
  - Battery
  - Bluetooth
  - Wifi
  - Vagrant Manager
  - Dropbox
  - Fast User Switching Menu
  - Applications Menu Settings
  - Notification center
  - Spotlight
  - Bartender

  - Hide
    - Growl
    - Karabiner
    - Spectacle
    - Carbon Copy Cloner
    - AirPort Display
    - Time Machine (completely)
    - Google Chrome (Hangouts)
    - Microsoft Remote Desktop

Arrangement-algorithm is most activity or cared about on the outside and less so
in the middle.

#+end_src

**** Growlnotify

#+begin_src sh :tangle emacs-run.sh :comments no
brew cask install growlnotify
#+end_src

**** CCrypt

#+begin_src sh :tangle emacs-run.sh :comments no
brew install ccrypt
#+end_src

**** Aspell

#+begin_src sh :tangle emacs-run.sh :comments no
brew install aspell -all
#+end_src

**** Java

At this point, test out Java and Langtool. The full Org stuff requires more
configuration, like Ditaa. This assumes that you've done the Emacs final config
stuff based on warnings at startup of Emacs; not on directions on this document.

#+begin_src sh :tangle emacs-run.sh :comments no
brew cask install java
#+end_src

** Emacs

I quit using railwaycat's emacs macport. It was really nice. One night I
reprovisionined my machine. railwaycat's repo was down. I learned that it was a
one-man show. I never thought about it. It means that it is not supported well.
Things that are supported well are likely to be available. I switched to the
GNU Emacs app. It has those desirable traits.

ImageMagic is required for the Emacs install, so install it first.

#+begin_src sh :tangle emacs-run.sh :comments no
brew install imagemagick --with-fftw --with-fontconfig --with-webp --with-x11
#+end_src

With all of Emacs prerequisites satisfied, install it now.

#+begin_src sh :tangle emacs-run.sh :comments no
brew install emacs --cocoa --with-gnutls --with-imagemagick
brew linkapps
#+end_src

The installer lists caveats. Do I need to know of these for each installer???

Now link my .emacs.el and try tangling.

#+begin_src sh :tangle emacs-run.sh :comments no
ln -s ~/git/bitbucket-grettke/alec/.emacs.el ~/.emacs.el
ln -s ~/git/bitbucket-grettke/alec/.aspell.en.pws ~/.aspell.en.pws
ln -s ~/git/bitbucket-grettke/alec/.aspell.en.prepl ~/.aspell.en.prepl
#+end_src

The eshell config lives under .emacs.d. It doesn't exist until Emacs is run.
This setup creates a link to the real .emacs.d. Create the directory first and
then link it.

#+begin_src sh :tangle emacs-run.sh :comments no
mkdir ~/.emacs.d
ln -s ~/git/bitbucket-grettke/alec/eshell/ ~/.emacs.d/eshell
#+end_src

Start Emacs. Remember any Emacs fixes. Everything should work.

* Productivity Semi-Automated

To be immediately productive with the most common use cases, I need all of
these apps.

Use cases:

- Communications
- Productivity
- Word processing
- Productivity is pretty broadly defined here. It means everything.

The installation process is similar to Emacs up above:

- Install the software automatically
- Configure it manually
- Manually run it and make sure that it is happy
  - You will find new stuff everytime you do this and you will get better at
    dev-ops and automate as much of it as you can and want to do

I am curious about how best to automate this portion of the installation. My
approaches were in order:

- Just let it run and try stuff later
  - Allows for installation failures which I don't like, it wastes time
    discovering the issue and resolving it
- Verify that each app starts
  - This is a fine approach. I would like to know at installation time though if
    there is a failure. Reading the transcript would be a good approach. Perhaps
    I should capture it, too.
  - Works easily for command line stuff via a script. GUI stuff is slower when
    I run it through Spotlight. Perhaps it is worth tracking down the
    installation directories of everything and starting them up via =open=?
    - Is this level of reproducibility required? Might need to quantify this.

Read through the installation messages at least once. You will learn things and
then you will improve the installation process.

** Files

I always end up keeping these temp files. Yes, temp files. They don't live in
source control.

#+begin_src sh :tangle productivity-run.sh :comments no
touch ~/tmp/post.org
touch ~/tmp/scratch.org
touch ~/tmp/todo.org
#+end_src

